In [1]:
import numpy  as np
import pandas as pd

# **Cadre de données**

In [2]:
maths_notes = pd.Series({"Christophe": 17, "Carla": 6, "Caroine": 20, "Jean-Baptiste": 2, "Florence": 15.5, "Emma": 19})
maths_notes

Christophe       17.0
Carla             6.0
Caroine          20.0
Jean-Baptiste     2.0
Florence         15.5
Emma             19.0
dtype: float64

In [3]:
# Créer un dataframe depuis la série
dataFrame_maths = pd.DataFrame(maths_notes , columns = ['Notes'])
dataFrame_maths

               Notes
Christophe      17.0
Carla            6.0
Caroine         20.0
Jean-Baptiste    2.0
Florence        15.5
Emma            19.0

In [4]:
# Créer un dataframe depuis un dictionnaire

In [5]:
d1 = {'a':5,'b':15,'c':25,'d':35}
d2 = {'a':10,'b':20,'c':30,'d':40}
d3 = {'a':100,'b':200,'c':300,'d':400}
d1

{'a': 5, 'b': 15, 'c': 25, 'd': 35}

In [6]:
d2

{'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [7]:
d3

{'a': 100, 'b': 200, 'c': 300, 'd': 400}

In [8]:
dataframe_dico = pd.DataFrame([d1,d2,d3])
dataframe_dico

     a    b    c    d
0    5   15   25   35
1   10   20   30   40
2  100  200  300  400

In [10]:
d4 = {'a':5,'b':15,'c':25,'d':35}
d5 = {'a':10,'b':20}
d6 = {}

In [12]:
dataframe_dico1 = pd.DataFrame([d4,d5,d6])
dataframe_dico1

      a     b     c     d
0   5.0  15.0  25.0  35.0
1  10.0  20.0   NaN   NaN
2   NaN   NaN   NaN   NaN

In [13]:
data_liste = [{'a':i,'b':2*i,'c':i*i} for i in range(10)]
data_liste

[{'a': 0, 'b': 0, 'c': 0},
 {'a': 1, 'b': 2, 'c': 1},
 {'a': 2, 'b': 4, 'c': 4},
 {'a': 3, 'b': 6, 'c': 9},
 {'a': 4, 'b': 8, 'c': 16},
 {'a': 5, 'b': 10, 'c': 25},
 {'a': 6, 'b': 12, 'c': 36},
 {'a': 7, 'b': 14, 'c': 49},
 {'a': 8, 'b': 16, 'c': 64},
 {'a': 9, 'b': 18, 'c': 81}]

In [14]:
dataframe_liste = pd.DataFrame(data_liste)
dataframe_liste

   a   b   c
0  0   0   0
1  1   2   1
2  2   4   4
3  3   6   9
4  4   8  16
5  5  10  25
6  6  12  36
7  7  14  49
8  8  16  64
9  9  18  81